<template>
    <ve-line :data="weekData"></ve-line>
</template>

<script>
    import {request} from '../utils/request'
    request({
        url: '/getJoke',
        params: {
            page: 1,
            count: 2,
            type: "video"
        }
    }).then(res => {console.log(res)}).catch(err => {console.log(err)})

    export default {
        data: function () {
            return {
                weekData: {
                    columns: ['日期', '用例数', '执行成功', '执行失败'],
                    rows: [
                        {'日期': '1/1', '用例数': 111, '执行成功': 108, '执行失败': 3},
                        {'日期': '1/2', '用例数': 115, '执行成功': 110, '执行失败': 5},
                        {'日期': '1/3', '用例数': 120, '执行成功': 120, '执行失败': 0},
                        {'日期': '1/4', '用例数': 82, '执行成功': 80, '执行失败': 2},
                        {'日期': '1/5', '用例数': 77, '执行成功': 76, '执行失败': 1},
                        {'日期': '1/6', '用例数': 105, '执行成功': 105, '执行失败': 0}
                    ]
                },
                monthData: {
                    columns: ['日期', '用例数', '执行成功', '执行失败'],
                    rows: [
                        {'日期': '1/1', '用例数': 111, '执行成功': 108, '执行失败': 3},
                        {'日期': '1/2', '用例数': 115, '执行成功': 110, '执行失败': 5},
                        {'日期': '1/3', '用例数': 120, '执行成功': 120, '执行失败': 0},
                        {'日期': '1/4', '用例数': 82, '执行成功': 80, '执行失败': 2},
                        {'日期': '1/5', '用例数': 77, '执行成功': 76, '执行失败': 1},
                        {'日期': '1/6', '用例数': 105, '执行成功': 105, '执行失败': 0}
                    ]
                },
                sessionData: {
                    columns: ['日期', '用例数', '执行成功', '执行失败'],
                    rows: [
                        {'日期': '1/1', '用例数': 111, '执行成功': 108, '执行失败': 3},
                        {'日期': '1/2', '用例数': 115, '执行成功': 110, '执行失败': 5},
                        {'日期': '1/3', '用例数': 120, '执行成功': 120, '执行失败': 0},
                        {'日期': '1/4', '用例数': 82, '执行成功': 80, '执行失败': 2},
                        {'日期': '1/5', '用例数': 77, '执行成功': 76, '执行失败': 1},
                        {'日期': '1/6', '用例数': 105, '执行成功': 105, '执行失败': 0}
                    ]
                },
            }
        }
    }
</script>